隐私政策=[[隐私政策
qwe12345678(本软件作者)开发了该开源的应用程序Mhdhhf浏览器。该服务由qwe12345678提供，旨在安装并使用。

我对您使用Mhdhhf浏览器的隐私政策做出规定，并解释了我如何收集，保护和披露您因使用我的服务而产生的信息。

如果您选择使用我提供的服务，则表示您同意收集和使用与此政策相关的信息。我收集的个人信息用于提供和改进服务。除非本隐私政策中另有说明，否则我不会与任何人一起使用或分享您的信息。

除非本隐私政策另有规定，否则本隐私政策中使用的术语与我们的条款和条件具有相同的含义，可在Mhdhhf浏览器中访问。

信息收集与使用

为了获得更好的体验，在使用我们的服务时，我可能会要求您向我们提供某些个人身份信息，包括但不限于不收集. 我请求的信息将保留在您的设备上，不会被我以任何方式收集。

记录数据

当您使用我的服务时，如果应用程序出现错误，我会通过第三方数据统计在您的手机上收集数据和信息。该日志数据可能包含以下信息，例如：您的设备Internet协议（ IP）地址，设备名称，操作系统版本，使用我的服务时应用的配置，您使用该服务的时间和日期以及其他统计信息。

Cookies

Cookies是具有少量数据的文件，通常用作匿名唯一标识符。 这些信息将从您访问的网站发送到浏览器，并存储在设备的内存中。

本应用未明确使用这些Cookies。但是，该应用程序可能使用第三方代码和使用带有Cookies的库来收集信息并改善其服务。 您可以选择接受还是拒绝这些Cookies，并知道何时将Cookies发送到您的设备。 如果您选择拒绝我们的Cookies，则可能无法使用本服务的部分功能。

服务供应商

我可能由于以下原因雇用第三方公司和个人：

促进我们的服务质量；
代表我们提供服务；
提供与服务相关的服务；
帮助我们分析如何使用我们的服务。
我想通知此服务的用户，这些第三方有权访问您的个人信息。原因是代表我们执行分配给他们的任务。但是，他们有义务不出于任何其他目的披露或使用该信息。

安全

我很重视您对我们提供您的个人信息的信任，因此我们正在努力使用商业上可接受的方法来保护它。但是请记住，没有一种通过互联网传输的方法，或者说电子存储的方法是100%安全可靠的，我不能保证它的绝对安全性。

到其他网站的链接

此服务可能包含指向其他网站的链接。如果你点击第三方链接，你将被引导到该网站。注意，这些外部站点不是由我操作的。因此，我强烈建议您查看这些网站的隐私策略。我对任何第三方网站或服务的内容、隐私政策或做法没有控制权，也不承担任何责任。

儿童隐私

这些服务不面向13岁以下的青少年。我不会有意收集13岁以下儿童的个人身份信息。如果我发现13岁以下的儿童向我提供了个人信息，我会立即从我们的服务器中删除这些信息。 如果您是父母或监护人，并且知道您的孩子向我提供了个人信息，请与我联系，以便我能够采取必要的措施。

本隐私政策的变更

我可能会不时更新我们的隐私政策。因此，建议您定期查看此页以了解更改。如有任何更改，我会在本页公布新的隐私政策。

该政策自2020-05-17起生效。

联系我们

如果您对我的隐私政策有任何疑问或建议，请随时通过zhongwenjia2009@163.com与我联系。


此隐私政策页面是在 privacypolicytemplate.net 创建的，并由 应用隐私政策生成器 生成。]]
用户协议=[[条款和条件
下载或使用该应用程序，此条款将自动适用于您——因此，请确保在使用该应用程序之前仔细阅读这些条款。.

qwe12345678(本软件作者)致力于确保该应用程序尽可能有用和高效。因此，我保留随时对应用程序进行更改或对其服务收费的权利。如果没有向您明确说明您支付的费用，我永远不会向您收取应用程序或其服务费用。

您应该意识到，qwe12345678在某些情况下不承担任何责任。应用程序的某些功能要求应用程序具有活动的internet连接。连接可以是Wi-Fi，也可以由您的移动网络提供商提供，但如果您无法访问Wi-Fi，并且您没有任何剩余的数据空间，则qwe12345678无法对应用程序无法完全正常工作承担责任。

同样，qwe12345678也不能总是对你使用应用程序的方式负责，也就是说，你需要确保你的设备保持充电状态——如果电池用完了，你不能打开它来使用服务，qwe12345678不能承担责任。

关于qwe12345678对您使用该应用程序的责任，当您使用该应用程序时，请务必记住，尽管我努力确保它在任何时候都是更新和正确运行的，但我依赖第三方向我提供信息，以便我可以向您提供信息。qwe12345678对于您因完全依赖应用程序的此功能而遭受的任何直接或间接损失，概不负责。

在某个时候，我可能希望更新应用程序。应用程序的需求可能会发生变化，qwe12345678不保证应用程序将始终更新，使其与您相关和或与您设备上安装的版本可以使用。但是，您保证在提供给您时始终接受该应用程序的更新。我也可能停止提供该应用程序，并且可以在不通知您终止的情况下随时终止其使用。除非我另行告知，否则在任何终止后，（a）这些条款授予您的权利和许可将终止；（b）您必须停止使用该应用程序，并且（如果需要）将其从设备中删除。

本条款和条件的变更

我可能会不时更新我的条款和条件。因此，建议您定期查看此页以了解更改。如有任何更改，我会在本页公布新的条款和条件。

这些条款和条件自2020-05-17起生效。

联系我们

如果您对我的隐私政策有任何疑问或建议，请随时通过zhongwenjia2009@163.com 与我联系。


此条款和条件页面是由 应用隐私政策生成器 生成的。]]
更新日志表={}
更新日志表["3.15"]=[[1.增加日志。
2.更换背景色后刷新网页。
3.主题去掉单个部分的标题，增加自定义功能，减少代码量。
4.修复打开对话框之后底部弹窗显示异常的bug。
5.修复首次启动页的问题。
6.优化代码架构。
7.下滑事件增加振动。
8.搜索按回车键搜索，按返回键退出。
9.优化粘贴功能在粘贴较长字符串时的表现。
10.增加长按搜索框菜单。
11.增加低栏的上滑、左滑和右滑手势。
12.优化了性能。
13.操作栏自动变色放进个性化，修改开关后不关闭菜单。
15.增加工具长按事件（只包含一部分工具），但是有一些没有做。
16.修复标题栏阴影。
17.工具去圈。
18.增加翻页器。
19.书签和历史进入的右上角菜单增加数据管理，点击之后会进入设置页面，并弹出点击数据管理按钮的提示。
20.横屏版设置。
21.增加侧栏收藏。
22.单独导出书签时，支持导出文件夹。
23.修复书签、历史和主页项目的一些bug。]]
更新日志表["3.13"]=[[1.对标签栏中的当前的标签突出。
2.添加主页项目之后不需要重启浏览器就可以在主页看到。
3.悬浮工具栏写法优化。
4.网页打开外部应用设置增加拦截。
5.修复一些bug。
6.暗色模式可以让网页变黑。
7.自有网页加载失败页面。
8.删除了一些目前基本上没有用的代码，主要是遗留的。
9.书签增加记录阅读位置的功能。
10.修复优化数据管理。
11.增加隐藏快速输入网址器的功能。
12.增加了几个搜索引擎。
13.优化开源许可页面的长按菜单，修复不能访问网页的bug。
14.非悬浮工具栏的菜单修改，在跟随系统暗色模式的时候左下角显示为页内查找。
15.网页源码在新标签页打开。
16.优化底部弹窗代码，减少代码行数。]]
更新日志表["3.12"]=[[1.修复脚本管理，工具脚本管理报错的问题。
2.垂直搜索按钮显示区背景颜色更换，设置中的快速搜索管理更名为垂直搜索(快速搜索)管理。
3.优化性能。
4.脚本管理、工具脚本管理、垂直搜索(快速搜索)管理、开源许可、更新日志修复关闭其中一个页面之后，再打开这里面的另外一个页面时还停留在上个页面的漏洞。
5.书签增加多选和排序，文件夹可以单独导出。
6.去除定位权限。
7.主页搜索栏增加粘贴按钮。
8.设置中的开关修改样式，而不是以前的文字样式。
9.操作设置中增加把标题栏放到底栏中时不需要点击切换窗口按钮就可以切换窗口、隐藏网页前进按钮和隐藏切换窗口按钮。
10.修复一些其他之前出错的功能。
11.悬浮窗增加焦点设置，修复在设置为搜索栏加常用网站主页时的书签和历史记录功能。
12.增加删除所有窗口的功能可在切换窗口弹窗打开或者长按窗口项目打开。
15.工具中增加横竖屏切换。
16.新版网页信息与分享。
17.优化代码架构。]]
更新日志表["3.11"]=[[1.优化分享功能，并增加转换为二维码的功能。
2.滑动菜单设置与说明增加滑动菜单模式和调整滑动菜单所需的按钮距离屏幕右侧边缘的距离的功能。
3.设置中浏览设置拆分出操作设置。
4.更改设置之后返回主页之后不需要退出再进入就能应用更改的设置。
5.除下载管理以外的页面不再进入新的activity。
6.优化性能。
7.工具箱里面的部分开关功能在被打开之后再打开工具箱就能点亮图标。
8.添加的脚本可以被放到滑动菜单的工具里面，同时也可以被放到滑动菜单的工具里面、菜单按钮上滑功能里和长按事件里。
9.长按的Shortcut增加历史记录，修复之前建过添加快捷方式.xml的不能升级到新的Shortcut的问题。
10.浏览器的长按菜单在长按的内容是图片时增加分享图片和分享动态图片，在长按的内容是链接时增加分享链接、收藏网页、保存网页、——，在长按的内容是链接时的菜单调整布局。
11.在桌面给网址添加Shortcut会用标题来制作图标。
12.书签和主页项目的分享支持二维码和卡片式的QQ分享，并且切换样式。
15.输入对话框不再修改编辑框颜色，所有对话框打开和关闭的动画加快。
16.缩小体积。
17.主页为收藏时的顶距缩小至8dp。
18.首次启动页增加“这个APP在启动时即使显示的页面也不一定加载完了。”、“把手按在右边的第2个小条上，就会显示常用功能，然后让手指在想用的功能松开，就可以启用那个功能。”；关闭动画加快到67毫秒；如果显示了之后点击了不同意，之后的启动它也会再显示，之前不是。
19.悬浮窗运行出错时会跳转到系统的获取悬浮窗权限页面。
20.把标题栏放到低栏并且开启滑动返回上个页面并且是竖屏时，会隐藏低栏上返回到上个页面的按钮。]]
更新日志表["3.10"]=[[1.修复主页链接为仅搜索栏并且没有收藏的时候的时候主页显示没有书签。
2.设置中的书签管理和历史记录合并为数据管理，增加主页项目。
3.设置中个性化拆分出主页。
4.设置中增加长按事件设置。
5.菜单按钮上滑有功能，并且可以设定功能和开关。
6.优化性能。
7.仅搜索栏主页改名为搜索栏加常用网站。
8.设置中增加操作栏自动变色。
9.主页项目显示在主页上时限制行数，书签和文件夹显示在页面上时也显示行数只有修改名称或者查看详细信息时不限制行数
10.设置字体大小的时候能够预览字体大小。
11.浏览设置中增加脚本管理。
12.点击左上角的按钮可以打开网页信息并且可以分享，但没有做好。]]
更新日志表["3.9"]=[[1.滑动显示隐藏操作栏增加动画。
2.增加清理浏览数据。
3.新版全屏首次启动页。
4.开源许可列表增加边框。
5.增加更新日志。
6.调整主题，把绿色替换成鸭绿，增加浅绿。
7.主页搜索修改弹出时的动画；增加清空输入框内容的按钮；增加搜索按钮和切换搜索引擎按钮的切换动画。
8.修改主页，搜索框圆角大小为15dp。
9.书签可添加文件夹。
10.修复修改主页搜索栏样式。
11.修改底栏样式。
12.多窗口升级为多窗口2.0。
15.底栏菜单的工具箱里面的部分工具在使用时增加判断是否有网页的功能。
16.底栏样式被设置为搜索样式使隐藏标题栏并在底栏菜单里面增加刷新按钮。
17.底栏菜单的工具箱增加网页调试功能。
18.可以设置把标题栏放到底栏中，并且可以在横屏时自动打开。
19.优化其他地方的横屏体验。
20.默认主页改为仅搜索栏。]]